DataProcessors/АРМРаботникОхраны_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АРМРаботникОхраны_2</Name>
			<Comment>Охрана Пост 2 Прием По СЧЕТ-ФАКТУРЕ(ГОРОД)</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/БольшаяЯчеистаяСборка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>БольшаяЯчеистаяСборка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеТары</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыПоШК</xr:Item>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
				<xr:Item>InformationRegister.РегТарыПоШК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВКомплект</Name>
					<Comment>Данный Документ входит в комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСписания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеТовараСЗоныОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКоробокПриПроверке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектБЯС</Name>
					<Comment>Документ комплект в котый входит данная сборка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коробки</Name>
					<Comment>Количество коробок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВСписке</Name>
					<Comment>Не показывать в списке НЕ РАСПРЕДЕЛЕННЫХ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогрузкаВАвто</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогрузкаТоваровВАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшивкиРаспечатанны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатыРаспечатаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСборки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Списан</Name>
					<Comment>Списание товара с зоны отгрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокМестХранений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКомплект</Name>
					<Comment>Данный Документ Является комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолТара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратВодителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыРасхода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Док</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолПозиций</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МестаОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКоробок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыКомплекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокБЯС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АРМРаботникОхраны_2/Forms/Форма14112013/Ext/Form/Module.bsl
//Евгений
&НаСервере
Функция НайденныйДок(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка КАК БЯС,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.НомерСтроки,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.Док,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.СчетФ,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.ШК,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.ДокНомер,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.Проверен,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.Комментарий,
	|	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка.ПутевойЛист
	|ИЗ
	|	Документ.БольшаяЯчеистаяСборка.ДокументыРасхода КАК БольшаяЯчеистаяСборкаДокументыРасхода
	|ГДЕ
	|	БольшаяЯчеистаяСборкаДокументыРасхода.ШК = &ШК";	
	Запрос.УстановитьПараметр("ШК", ШК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.БЯС;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	
	
	
КонецФункции



////Евгений
//&НаСервере
//Функция СоздатьДокументПриходаНаСервере()
//	НовыйДокументПрихода = Документы.ПриходТовараНаМестоОтгрузки.СоздатьДокумент();
//	Возврат НовыйДокументПрихода.Ссылка;
//КонецФункции



Процедура НайтиДок()
	//Запрос =Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ТоварыНаСкладахОстатки.НомерМестаОтгрузки КАК НомерМеста,
	//			   |	ТоварыНаСкладахОстатки.ДокументПрихода КАК Документ,
	//			   |	ТоварыНаСкладахОстатки.Контрагент КАК Контрагент,
	//			   |	ТоварыНаСкладахОстатки.КоличествоКоробокОстаток КАК Количество,
	//			   |	ТоварыНаСкладахОстатки.ОбъемОстаток КАК Объем,
	//			   |	ТоварыНаСкладахОстатки.ВесОстаток КАК Вес
	//			   |ИЗ
	//			   |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки";
	//Результат = Запрос.Выполнить();
	//СписокДокументов.Загрузить(Результат.Выгрузить());
КонецПроцедуры

//**********************************************************//

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		
		Если ЗначениеЗаполнено(СокрЛП(Данные)) Тогда
			//--- Сброс Формы
			//Сообщить(СокрЛП(Данные));
			Если (СокрЛП(Данные))="000000000000" Тогда
				Сброс(Null);
				ОчиститьСообщения();
				//Сообщить("Сброс");
				Возврат;
			КонецЕсли;
			
			Если (СокрЛП(Данные))="111111111111" Тогда
				//Сохранить запись
				 Сохранить(Null);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		//Если охрана не заполнена то Ищем Охранника
		Если Не ЗначениеЗаполнено(ШКОхрана) Тогда
			ШКОхрана = Данные;
			НайденныйОхранник = НайтиФизЛицоПоШк(ШКОхрана,"РаботникОхраны");
			Если Не ЗначениеЗаполнено(НайденныйОхранник) Тогда
				ОчиститьСообщения();
				Сообщить("Охранник не найден!!!");
				ШКОхрана = "";
				РаботникОхраны = "";
			Иначе 
				РаботникОхраны = НайденныйОхранник;
			КонецЕсли;
			Возврат;
		КонецЕсли;	
		
		//Если Охрана заполнена - Ищем Водителя		
		
		Если ЗначениеЗаполнено(ШКОхрана) Тогда
			ШКНовыйВодитель = Данные;
			НовыйВодитель = НайтиФизЛицоПоШк(ШКНовыйВодитель,"Водитель");
			
			//Проверка на нового водителя
			Если ЗначениеЗаполнено(Водитель) Тогда  // Тогда проверка на нового водителя
				Если ЗначениеЗаполнено(НовыйВодитель) Тогда
					//Проверяем это новый или нет
					Если НовыйВодитель<>Водитель Тогда
						
												
						Водитель=НовыйВодитель;
						ШКВодитель=ШКНовыйВодитель;
						Возврат;
					КонецЕсли;
									
				КонецЕсли;
			Иначе
				
				
				Водитель=НовыйВодитель;
				ШКВодитель=ШКНовыйВодитель;
                 Возврат;
			КонецЕсли;
		КонецЕсли;
		
		
		
		
		//Ищем документ 
		
		//Если Не ЗначениеЗаполнено(ШК) Тогда
		ШК = Лев(Данные, СтрДлина(Данные) - 1);
		Док = НайденныйДок(ШК);
		
		Если ЗначениеЗаполнено(Док) Тогда
			// Показать данные документа
	  		БЯС=Док;
		 	ЭтаФорма.ПутевойЛист=БЯС.ПутевойЛист;
			
			//Водитель=Док.ПутевойЛист.Водитель;
			//ШКВодитель= Док.ПутевойЛист.Водитель.Штрихкод;
			СчетФ=(Док.НомераСФ);
			//Сообщить(Док.Комментарий);
			КолКоробокБЯС=(Док.Коробки);	
			
			// Кол Если уже был вывоз
			ДокументПогрузкаВАвто = ПроверитьНаличиеДокумента(ШК);
			Если ЗначениеЗаполнено(ДокументПогрузкаВАвто) Тогда
				ДокПогрузкаВАвто=ДокументПогрузкаВАвто;
				Водитель=ДокументПогрузкаВАвто.Водитель;
				ШКВодитель= ДокументПогрузкаВАвто.Водитель.Штрихкод;

				КолКоробокВАвто= ДокументПогрузкаВАвто.КоличествоКоробок;
				//КолКоробок=КолКоробокБЯС-КолКоробокВАвто;	
				КолКоробок=КолКоробокВАвто;	
				//Проверка на полный вывоз
				Если КолКоробокВАвто =КолКоробокБЯС Тогда
					Сообщить("Документ полностью вывезен.");
					Возврат;
				КонецЕсли;
			Иначе	
				КолКоробокВАвто= 0;
				КолКоробок=КолКоробокБЯС;
				ДокПогрузкаВАвто="";
				
			КонецЕсли;
			
			
		Иначе
			ОчиститьСообщения();
			Сообщить("Документ не найден!!!");
			ШК = "";
			Сброс(Неопределено);
			Возврат;
		КонецЕсли;
		
		
	КонецЕсли;		
КонецПроцедуры


//**************************************************************//



&НаСервере
Функция НайтиФизЛицоПоШк(ШКФизЛицо,Должность)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Штрихкод = &Штрихкод
	|	И ФизическиеЛица.Должность В(&Должность)";
	
	Запрос.УстановитьПараметр("Штрихкод", ШКФизЛицо);
	
	Должности=Новый Массив;
	Если Должность="Водитель" Тогда
		Должности.Добавить(Справочники.Должности.Водитель);
		Должности.Добавить(Справочники.Должности.Филиал);
	ИначеЕсли Должность="РаботникОхраны" Тогда
		Должности.Добавить(Справочники.Должности.РаботникОхраны);
	КонецЕсли;
	Запрос.УстановитьПараметр("Должность", Должности);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
КонецФункции


&НаСервере
Функция ПроверитьНаличиеДокумента(ШК)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПогрузкаТоваровВАвтомобиль.Ссылка
	|ИЗ
	|	Документ.ПогрузкаТоваровВАвтомобиль КАК ПогрузкаТоваровВАвтомобиль
	|ГДЕ
	|	ПогрузкаТоваровВАвтомобиль.ДокументыРасхода.ШК = &ШК";
	Запрос.УстановитьПараметр("ШК", ШК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли; 
	
	
КонецФункции

//&НаСервере
//Функция СоздатьДокументПогрузкаНаСервере()
//	НовыйДокументПриема = Документы.ПогрузкаТоваровВАвтомобиль.СоздатьДокумент();
//	Возврат НовыйДокументПриема.Ссылка;
//КонецФункции

&НаКлиенте
Процедура Сброс(Команда)
	Если Не СбросКромеОхраны Тогда
		РаботникОхраны="";
		ШКОхрана="";
		ШКВодитель="";
		Водитель="";

	КонецЕсли;
	
	ШК="";
	ШКАвтомобиль="";
		Автомобиль="";
	БЯС="";
	ПутевойЛист="";
	КолКоробок=0;
	СчетФ="";
	КолКоробокБЯС=0;
	КолКоробокВАвто=0;
	ДокПогрузкаВАвто="";
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СбросКромеОхраны=Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	//Проверка На КолКоробок
	
	ЭтаФорма.ТекущийЭлемент=Элементы.ДокПогрузкаВАвто;
	Если КолКоробок=0 Тогда
		ЭтаФорма.ТекущийЭлемент=Элементы.КолКоробок;
       //	Сообщить("Заполните количество коробок.");
	   Предупреждение("Заполните количество коробок.");
		Возврат;	
	КонецЕсли;
	
	
	Если ШК="" Тогда
		Сообщить("Нет Данных.");
		Возврат;
	КонецЕсли;
	СохранитьСЕРВЕР();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСЕРВЕР()
	
	//Проверка на общее кол коробок
	//Если КолКоробокБЯС<(КолКоробок+КолКоробокВАвто)  Тогда
	//	Сообщить("ОШИБКА!. Сумма коробок в Авто и вывозимое больше чем в документе.");
	//	Возврат;
	//КонецЕсли;
	
	
	//Сохраняем (Создаем) документ  ПогрузкаТоваровВАвтомобиль
	Документ = ПроверитьНаличиеДокумента(ШК);
	Если Документ = Неопределено Тогда
		//Создаем Документ
		Документ=Документы.ПогрузкаТоваровВАвтомобиль.СоздатьДокумент();
		Документ.Дата =ТекущаяДата();
		Документ.Водитель=Водитель;
		Документ.РаботникОхраны=РаботникОхраны;
		Документ.Подразделение=БЯС.Организация;
		Документ.ПутевойЛист=ПутевойЛист;
		Документ.ДокументОснование=БЯС;
		Документ.Контрагент=БЯС.Получатель;
		Документ.КоличествоКоробок=КолКоробок;
		Документ.ДокументыРасхода.Загрузить(БЯС.ДокументыРасхода.Выгрузить());
		Документ.МестаОтгрузки.Загрузить(БЯС.МестаОтгрузки.Выгрузить());
		
		//Для Каждого стрМестоОтгрузки Из БЯС.МестаОтгрузки Цикл
		//новаяСтр=Документ.МестаОтгрузки.Добавить();
		//новаяСтр.МестоОтгрузки=стрМестоОтгрузки.МестоОтгрузки;
		//новаяСтр.КоличествоКоробок=стрМестоОтгрузки.КоличествоКоробок;
		//КонецЦикла;
		
	Иначе
		Документ=Документ.ПолучитьОбъект();
		Документ.Водитель=Водитель;
        Документ.ПутевойЛист=ПутевойЛист;
		//Документ.КоличествоКоробок=(КолКоробок+КолКоробокВАвто);
		//Сообщить(КолКоробок);
		Документ.КоличествоКоробок=КолКоробок;
	КонецЕсли;
	
	//Ставим Дату Конца Отгрузки в БЯС
	Попытка
		ДокБЯС=БЯС.ПолучитьОбъект();
		ДокБЯС.КонецОтгрузки=ТекущаяДата();
		ДокБЯС.Записать(РежимЗаписиДокумента.Запись);
	Исключение
	КонецПопытки;
	//
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	Сообщить("Данные Записаны.");
КонецПроцедуры

&НаКлиенте
Процедура СменитьВодителя(Команда)
	Если Не ЗначениеЗаполнено(НовыйВодитель) Тогда
		Сообщить("Нет Данных.");
		Возврат;
	КонецЕсли;
	
	Если Вопрос("Сменить Водителя на "+НовыйВодитель, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;	
	КонецЕсли;
	
	
	СменитьВодителяСЕРВЕР();
	
	//Обновить Документ ШК
	 ОбновитьДокумент();
КонецПроцедуры

&НаСервере
Процедура  СменитьВодителяСЕРВЕР()
	//Смена водителя
	
	
	ПутевойЛистСтарый=ПутевойЛист.ПолучитьОбъект();	 
	//Ещем путевой ли на сегодня у нового водителя
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПутевойЛист.Ссылка ПутевойЛистСсылка
	|ИЗ
	|	Документ.ПутевойЛист КАК ПутевойЛист
	|ГДЕ
	|	ПутевойЛист.Водитель = &Водитель
	|	И ПутевойЛист.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Водитель", НовыйВодитель);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()) );
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		// Меняем Водителя
		НачатьТранзакцию();
		//Попытка
		
		// Добавляем в путевой лист нового водителя
		ПутевойЛистНовый=ВыборкаДетальныеЗаписи.ПутевойЛистСсылка.ПолучитьОбъект();
		Для Каждого стрПутевойЛистСтарыйДанные Из ПутевойЛистСтарый.Данные Цикл
			Если  стрПутевойЛистСтарыйДанные.ДокументПрихода = БЯС Тогда
				НоваяСтрока=ПутевойЛистНовый.Данные.Добавить();
				НоваяСтрока.ДокументПрихода=стрПутевойЛистСтарыйДанные.ДокументПрихода;
				НоваяСтрока.Контрагент=стрПутевойЛистСтарыйДанные.Контрагент;
				НоваяСтрока.МестоОтгрузки=стрПутевойЛистСтарыйДанные.МестоОтгрузки;
				НоваяСтрока.КоличествоКоробок=стрПутевойЛистСтарыйДанные.КоличествоКоробок;
				НоваяСтрока.Вес=стрПутевойЛистСтарыйДанные.Вес;
				НоваяСтрока.Объем=стрПутевойЛистСтарыйДанные.Объем;
			КонецЕсли;	
		КонецЦикла;
		ПутевойЛистНовый.Записать(РежимЗаписиДокумента.Проведение);
		// Удаляем сборки в путевом листе старого водителя
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ДокументПрихода", БЯС);
		строкиДляУдаления= ПутевойЛистСтарый.Данные.НайтиСтроки(ПараметрыОтбора);
		Если строкиДляУдаления.Количество()>0 Тогда
			Для Каждого эл_строкиДляУдаления Из строкиДляУдаления Цикл
				ПутевойЛистСтарый.Данные.Удалить(эл_строкиДляУдаления);	
			КонецЦикла;
			ПутевойЛистСтарый.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		// В БЯС Меняем Путевой Лист
		докБЯС= БЯС.ПолучитьОбъект();
		докБЯС.ПутевойЛист=ПутевойЛистНовый.Ссылка;
		докБЯС.Записать(РежимЗаписиДокумента.Проведение);
		
		//Исключение
		//КонецПопытки;
		
		ЗафиксироватьТранзакцию();
	Иначе
		Сообщить("У нового водителя нет путевого листа на "+Строка(НачалоДня(ТекущаяДата())));
		Возврат;
	КонецЕсли;
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДокумент()
//ШК = Лев(Данные, СтрДлина(Данные) - 1);
		Док = НайденныйДок(ШК);
		
		Если ЗначениеЗаполнено(Док) Тогда
			// Показать данные документа
			БЯС=Док;
			ЭтаФорма.ПутевойЛист=БЯС.ПутевойЛист;
			//Водитель=Док.ПутевойЛист.Водитель;
			ШКВодитель= Док.ПутевойЛист.Водитель.Штрихкод;
			СчетФ=(Док.НомераСФ);
			//Сообщить(Док.Комментарий);
			КолКоробокБЯС=(Док.Коробки);	
			
			// Кол Если уже был вывоз
			ДокументПогрузкаВАвто = ПроверитьНаличиеДокумента(ШК);
			Если ЗначениеЗаполнено(ДокументПогрузкаВАвто) Тогда
				Водитель=ДокументПогрузкаВАвто.Водитель;
				КолКоробокВАвто= ДокументПогрузкаВАвто.КоличествоКоробок;
				//КолКоробок=КолКоробокБЯС-КолКоробокВАвто;	
				КолКоробок=КолКоробокВАвто;	
				//Проверка на полный вывоз
				Если КолКоробокВАвто =КолКоробокБЯС Тогда
					Сообщить("Документ полностью вывезен.");
					Возврат;
				КонецЕсли;
			Иначе	
				КолКоробокВАвто= 0;
				КолКоробок=КолКоробокБЯС;
			КонецЕсли;
			
			
		Иначе
			ОчиститьСообщения();
			Сообщить("Документ не найден!!!");
			ШК = "";
			Сброс(Неопределено);
			Возврат;
		КонецЕсли;
	
КонецПроцедуры
